import java.util.Arrays;

public class Main {

    //  Пример 1. Программа выводит значение 33. Это происходит, потому что функция(метод) changeValue ни чего не возвращает
                  // или нет присвоения нового значения в переменную.
    //  Пример 2. Программа выводит значение 33. Это происходит, потому что функция(метод) changeValue ни чего не возвращает
                 // или нет присвоения нового значения в переменную.
    //  Пример 3. Программа выводит значение {3,4}. Это происходит, потому что функция(метод) changeValue ни чего не возвращает
                 // или нет присвоения нового значения в переменную.
    //  Пример 4. Программа выводит значение {99,4}. Это происходит, потому что функция(метод) changeValue меняет первый символ массива в памяти.
    //  Пример 5. Программа выводит значение Fedor Dostoevskiy. Это происходит, потому что функция(метод) changeValue ни чего не возвращает
                 // или нет присвоения нового значения в переменную.
    //  Пример 6. В таком виде выдаст ошибку! Зачем путать людей таким условием!!!!!!!???????
}


